# GetConditionName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationServiceButton..::..GetConditionName Method
FabricationServiceButton Class See Also
---
Gets the name of the specified condition on the fabrication service button.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string GetConditionName(
	int condition
)
```

Visual Basic
---
```text
Public Function GetConditionName ( _
	condition As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetConditionName(
	int condition
)
```

# ### Parameters
condition
    Type: System..::..Int32 The condition index.
# ### Return Value
The name of the specified condition on the fabrication service button.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The index condition is not larger or equal to 0 and less than ConditionCount. |

# See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace